package com.emil.org.emil.kotlincourse.lesson5

fun main () {
    printSoundAttenuation(100.0, 7.7)
    printSoundAttenuation(100.0, null)

    printDeliveryPrice(9.0)
    printDeliveryPrice(null)

    printError(756)
    printError(null)
}
/*
Контекст: Вы изучаете физическое явление затухания звука в помещении.
У вас есть измеренное значение начальной интенсивности звука,
но из-за ограничений оборудования данные о коэффициенте затухания иногда могут быть неизвестны.
Задача: Рассчитать предполагаемую интенсивность звука после затухания.
Интенсивность звука после затухания пропорциональна начальной интенсивности, умноженной на коэффициент затухания.
Если коэффициент затухания неизвестен, использовать стандартное значение 0.5.
*/
fun printSoundAttenuation (initialIntensity: Double, attenuationCoefficient: Double?) {
    println(initialIntensity * (attenuationCoefficient ?: 0.5))
}

/*
Контекст: Клиент оплачивает доставку груза.
К стоимости доставки добавляется страховка на груз, которая составляет 0,5% от его стоимости.
В случае, если стоимость не указана, то берётся стандартная стоимость в $50
Задача: Рассчитать полную стоимость доставки.
 */

fun printDeliveryPrice (price: Double?, procent: Double = 0.5) {
    val cargoInsurance = ((price ?: 50.0) / 100 * procent)
    println((price ?: 50.0) + cargoInsurance)
}
/*
Контекст: Вы проводите метеорологические измерения.
Одним из важных показателей является атмосферное давление, которое должно быть зафиксировано.
Лаборант приносит вам набор показателей, но по пути может что-нибудь потерять.
Задача - сообщить об ошибке в случае отсутствия показаний атмосферного давления.
 */

fun printError(atmosDav: Int?) {
    println(atmosDav ?: throw Exception("Показания атмосферного давления отсутствуют"))
}